/*************************************************************************************
 * 文件:    cut/config.h
 *
 * 描述:    cut配置文件
 *
 * 作者:    Jun
 *
 * 时间:    2012-10-25
*************************************************************************************/
#ifndef CUT_CONFIG_H
#define CUT_CONFIG_H


/*------------------------------------------------------------------------------------
 * 
 *          横切机配置数据结构
 * 
**----------------------------------------------------------------------------------*/
struct cut_config_s {                
    INT32U magic;               /* 文件有效标识 */
    int    size;                /* 文件大小     */    
    struct __spdlmt {           /* 限速表       */
        INT16S cutlen;
        INT16S spdlmt;
    } spdlmt_tbl[CONFIG_SPDLMT_SIZE];
    struct __port {             /* 串口设置     */                   
        INT16S base;
        INT32S baudrate;
        INT16S data;
        INT16S stop;
        INT16S parity;
        INT16S int_no;
    } port1,
      port2;
    int driver_type;            /* 驱动器类型 */
    int language;               /* 语言, 0=中文, 1=英语 */
    int reset_onstartup;        /* 复位提示 */
    int today_data_show;        /* 本日生产数据的显示, 1=显示, 0=不显示 */
    int font_big1;              /* 大号字体的选择 */
    int font_big2;

    INT16S min_cutlen;          /* 切长的最小值 */
    int    mm_inch;             /* 公英制设定, 0=公制, 1=英制 */
    INT16S speed_scale;         /* 车速比例 */
    INT16S speed_plus;          /* 车速增益 */
    int    alarm_count;         /* 闪灯张数 */
    int    scrap_count;         /* 切废功能设定, 0=关闭, >0代表切废张数 */
    INT16S scrap_cutlen;        /* 切废时的切长 */
    int    overspd_alarm_en;    /* 超速闪灯开关 */
    int    oc_speaker_en;       /* 换单警报开关 */
    int    pushmark_en;         /* 喷墨开关 */
};

#define config_magic   0x00545543L      /* 配置文件标识字"CUT" */

#ifdef CUT_CONFIG_C
struct cut_config_s config = {
            config_magic,               /* 文件有效标识 */
            0,
            {                           /* 限速表 */
                {500,   70},
                {600,   90},
                {650,   100},
                {700,   110},
                {750,   130},
                {800,   150},
                {850,   180},
                {900,   180},
                {1100,  190},
                {1150,  190},
                {1300,  190},
                {1500,  190},
                {1600,  190},
                {1800,  190},
                {2000,  190},
                {2200,  190},
            },
            { 0x3F8, 38400L, 7, 1, COM_PARITY_EVEN, 4 }, /* 串口1 */
            { 0x2F8, 38400L, 7, 1, COM_PARITY_EVEN, 3 }, /* 串口2 */
            0,          /* 类型: 正频 */
            0,          /* 默认中文 */
            1,          /* 默认需要提示 */
            0,          /* 默认不显示本日数据 */
            0, 0,       /* 大字体默认均为0 */
            500,        /* 最小长度 */
            0,          /* 公制 */
            1000,       /* 车速比例, 1.000 */
            0,          /* 车速增益 */
            12,         /* 闪灯张数默认值 */
            0,          /* 切废功能 */
            600,        /* 切废切长 */
            1,          /* 超速闪灯 */
            1,          /* 换单警报 */
            0,          /* 喷墨开关 */
};
#endif

/*------------------------------------------------------------------------------------
 * 
 *      函数声明
 * 
**----------------------------------------------------------------------------------*/
BOOL  read_config(void);
BOOL  save_config(void);
BOOL  check_config(void);
BOOL  active_config(void);
BOOL  copy_to_config(struct cut_config_s * cfg);


#endif /* #ifndef CUT_CONFIG_H */

/*====================================================================================
 * 
 * 本文件结束: cut/config.h
 * 
**==================================================================================*/

