/*************************************************************************************
 * 文件:    cut/version.c
 *
 * 说明:    CUT版本号
 *
 * 作者:    Jun
 *
 * 创建:    2012-10-29
*************************************************************************************/
#define  CUT_VERSION_C
#include <FamesOS.h>
#include "common.h"

/*------------------------------------------------------------------------------------
 *                  CUT版本号(VERSION)
 * 
 * 说明: 版本号由两部分组成:
 *
 *       1) major:  主版本号, 主版本号的变化代表了较大的或者较本质的改变
 *       2) minor:  次版本号, 次版本号的变化代表了在部分功能上有所加强或改变
**----------------------------------------------------------------------------------*/
char  ___NAME[]      =      "CUT";
char  ___AUTHOR[]    =      "Jun";

#define VersionMajor         0
#define VersionMinor         0

#define VersionString       "0.0.1" /* 不可超过32个字节 */

INT16U get_version(void)
{
    INT16U ver = 0;

    ver |=(INT16U)VersionMajor&0xFF;
    ver<<=8L;
    ver |=(INT16U)VersionMinor&0xFF;

    return ver;
}

STRING get_version_string(void)
{
    return VersionString;
}

/*
**      下面为版本记录
*-------------------------------------------------------------------------------------
*
*  从2012-10-10日开始创建, 正在开发当中...
*
*
*
*
*
*  注意: 该系统以SLC为基础修改而来.
*
*-------------------------------------------------------------------------------------
** 
*/


/*====================================================================================
 * 
 * 本文件结束: cut/version.c
 * 
**==================================================================================*/


